math-proofs.org
* Introduction
  The purpose of this project is to compile mathematical proofs that are both rigorous and easy to understand.
  At first, the format of the proof may be somewhat aleatory (video, picture, text, etc), but with time I would like to format them in an appropriate language, such as LaTex, and design the functions with python, for example.
* Test

\begin{equation}                        % arbitrary environments,
x=\sqrt{b}                              % even tables, figures
\end{equation}
\begin{equation}
x\leq{y}\leq{f}
\end{equation}
* Derivative of product
Definition of derivative:

\begin{equation}
h\ensuremath{'}(x) = \lim_{\Delta{x} \to 0}\frac{h(x+\Delta {x}) - h(x)}{\Delta x}
\end{equation}

Provided that the limit exists. We now express h using the product of f and g.

\begin{equation}
\begin{split}
h\ensuremath{'}(x) &= \lim_{\Delta{x} \to 0}\frac{h(x+\Delta {x}) - h(x)}{\Delta x} \\
                   &= \lim_{\Delta{x} \to 0}\frac{f(x+\Delta {x})g(x+\Delta {x}) - f(x)g(x)}{\Delta x}
\end{split}
\end{equation}

To make further progress, we need to relate our limit formula to the limit formulas for the derivatives of f and g, namely


\begin{equation}
f\ensuremath{'}(x) = \lim_{\Delta{x} \to 0}\frac{f(x+\Delta {x}) - f(x)}{\Delta x}
\end{equation}


\begin{equation}
g\ensuremath{'}(x) = \lim_{\Delta{x} \to 0}\frac{g(x+\Delta {x}) - g(x)}{\Delta x}
\end{equation}

We use the trick of adding and subtracting

\begin{equation}
f(x)g(x+\Delta {x})
\end{equation}

\begin{equation}
\begin{split}
h\ensuremath{'}(x) &= \lim_{\Delta{x} \to 0}\frac{f(x+\Delta {x})g(x+\Delta {x}) - f(x)g(x)}{\Delta x} \\
                   &= \lim_{\Delta{x} \to 0}\frac{f(x+\Delta {x})g(x+\Delta {x}) + (f(x)g(x+\Delta {x}) - f(x)g(x+\Delta {x})) - f(x)g(x)}{\Delta x} \\
\end{split}
\end{equation}
* Riemann Zeta function
  \begin{equation}
  \zeta(s) =\sum_{n=1}^\infty\frac{1}{n^s}
  \end{equation}
#+name: hello-world
#+BEGIN_SRC latex
\LaTeX
#+END_SRC
* Plots
#+begin_src latex :file tikz.pdf :packages '(("" "tikz"))
\begin{figure}[h]
\centering
\begin{tikzpicture}[x=5cm]
  \draw[xstep=.1,ystep=.1,lightgray,ultra thin](-0.1,-1.5)grid(1.1,1.5);
  \draw[->](0,0)--(1.1,0)node[right]{$x$};
  \draw[->](0,-1)--(0,1.1)node[above]{$penis$};
  \draw[blue,domain=0.01:1,samples=1000]plot(\x,{sin((1/\x)r)});
\end{tikzpicture}
\end{figure}
#+END_SRC

#+RESULTS:
#+begin_export latex
[[file:tikz.pdf]]
#+end_export

#+begin_src latex :file fsa.pdf :packages '(("" "tikz")) :border 1em
  % Define block styles
  \usetikzlibrary{shapes,arrows}
  \tikzstyle{astate} = [circle, draw, text centered, font=\footnotesize, fill=blue!25]
  \tikzstyle{rstate} = [circle, draw, text centered, font=\footnotesize, fill=red!25]

  \begin{tikzpicture}[->,>=stealth', shorten >=1pt, auto, node distance=2.8cm, semithick]
    \node [astate] (1) at (0,0) {1};
    \node [astate] (2) at (1,0) {2};
    \node [rstate] (3) at (2,0) {3};
    \path (1) edge [bend left] node {b} (2)
          (2) edge node {b} (3)
          (2) edge [bend left] node {a} (1)
          (3) edge [loop above] node {(a, b)} (3);
  \end{tikzpicture}
#+end_src

#+RESULTS:
#+begin_export latex
[[file:fsa.pdf]]
#+end_export
